[
  {
    "id": "pf-1740150000000-comal-county-republicans-10-advisory-propositions-explained",
    "date": "2026-02-21T09:00:00",
    "title": "What Comal County Republicans Are Voting On: 10 Advisory Propositions Explained",
    "summary": "The March 3, 2026 Republican primary ballot includes 10 non-binding advisory propositions covering property taxes, parental rights, border security, term limits, water sovereignty, and more. Here's what each one means for conservative voters in Comal County.",
    "content": "On March 3, 2026, Comal County Republicans head to the polls not just to choose their party's nominees — but to weigh in on 10 non-binding advisory propositions that will signal Republican voter priorities to the Texas Legislature and party leadership ahead of the 2027 session. These propositions do not change state law, but their results are expected to shape the Texas GOP Convention in June 2026 and drive the legislative agenda in Austin.\n\nHere's what each proposition means:\n\n**Prop 1 — Property Tax Abolition:** Should Texas assess property taxes at purchase price and phase out the tax entirely over six years through spending cuts? This is the boldest tax relief proposal in a generation — a path to eliminating property taxes rather than merely reducing them.\n\n**Prop 2 — Voter Approval on Tax Hikes:** Should any local government budget that raises property taxes require voter approval at a November election? This would give taxpayers direct veto power over tax increases at every level of local government.\n\n**Prop 3 — Medical Freedom:** Should Texas prohibit denial of healthcare based solely on vaccination status? A response to COVID-era healthcare mandates, this affirms that medical decisions are between patient and doctor — not government or insurance bureaucrats.\n\n**Prop 4 — Pro-Life Education:** Should Texas public schools teach that life begins at fertilization? This would align public school curriculum with Texas's post-Dobbs legal framework and conservative values on human life.\n\n**Prop 5 — Parental Rights in Schools:** Should Texas ban gender, sexuality, and reproductive clinics and services in K-12 schools? This returns those decisions to parents and family physicians — not school systems.\n\n**Prop 6 — Term Limits:** Should Texas enact term limits on all elected officials? A broadly popular reform that would end career-politician culture from city hall to the Capitol.\n\n**Prop 7 — Texas Water Sovereignty:** Should Texas ban large-scale export or sale of groundwater and surface water to any single entity? Critical for fast-growing communities like Comal County, where water supply is a long-term concern.\n\n**Prop 8 — Immigration and Taxpayers:** Should the Legislature reduce the burden of illegal immigration by ending public services for illegal immigrants? This signals support for directing taxpayer resources to legal residents and citizens.\n\n**Prop 9 — Republican Majority Should Lead:** Should the Republican-controlled Legislature stop awarding committee chairmanships to Democrats? Many conservatives argue a supermajority mandate means Republicans should govern — fully.\n\n**Prop 10 — American Law in Texas Courts:** Should Texas prohibit Sharia Law? A reaffirmation that U.S. and Texas constitutional principles are the supreme legal standard in Texas courts.\n\nEarly voting runs February 17–27. Primary Election Day is March 3, 2026. Polls open 7 a.m. to 7 p.m.\n\nSource: Republican Party of Texas / Texas Secretary of State",
    "source": "Hill Country Sentinel",
    "tags": [
      "republican-primary",
      "ballot-propositions",
      "voter-guide",
      "comal-county",
      "property-tax",
      "parental-rights",
      "border-security",
      "term-limits"
    ],
    "category": "elections",
    "image": null,
    "sourceUrl": null
  },
  {
    "id": "pf-1740153600000-property-tax-abolition-parental-rights-what-matters-most-comal",
    "date": "2026-02-21T10:00:00",
    "title": "The Two Republican Propositions That Matter Most for Comal County Conservatives",
    "summary": "Of the 10 non-binding GOP primary propositions on the March 3 ballot, two stand out as especially consequential for Comal County: the push to phase out property taxes entirely, and the drive to restore parental authority over what happens to children in public schools.",
    "content": "Among the 10 advisory propositions on the March 3 Republican primary ballot, two deserve special attention from Comal County conservatives: the property tax phase-out (Prop 1) and the parental rights agenda in schools (Props 4 and 5). Together, they represent the core of what Texas Republicans want from the 2027 Legislature.\n\n**Prop 1: The Property Tax Abolition That Could Change Everything**\n\nComal County's rapid growth has come with a painful side effect: soaring property tax bills. New Braunfels homeowners have watched their assessed values — and their tax bills — climb year after year, even as Texas law provides only modest relief through homestead exemptions and rate compression.\n\nProposition 1 goes further than any previous reform proposal: it would assess property taxes at purchase price (capping reassessment for existing owners, similar to California's Prop 13) and then phase out property taxes entirely over six years through spending reductions. No more property tax. Period.\n\nThis is not incremental relief — it is the elimination of a tax that many Texans consider a form of perpetual rent paid to government just to keep the home you already own. For retirees on fixed incomes, families in rapidly appreciating neighborhoods, and small business owners, the stakes could not be higher. A yes vote on Prop 1 sends the message to Austin that voters want the Legislature to chart a path to zero.\n\n**Props 4 and 5: Parental Rights in the Classroom**\n\nComal County parents have been among the most engaged in the state when it comes to pushing back on what their children are taught in public schools. Propositions 4 and 5 codify two conservative priorities that have strong local support.\n\nProp 4 would require Texas public schools to teach that life begins at fertilization — aligning curriculum with Texas's Human Life Protection Act and affirming a scientific and moral truth that conservatives believe should not be sidestepped in biology class.\n\nProp 5 would ban gender, sexuality, and reproductive clinics and services from K-12 campuses entirely — keeping those conversations in the family, where they belong. Supporters argue that schools are for academic education; medical and social decisions about a child's identity or health are matters for parents and physicians.\n\nTogether, these propositions reflect a clear message from the Republican base: the progressive drift that captured many suburban school districts elsewhere in the country is not welcome in Comal County.\n\n**What Happens After March 3?**\n\nThe results of all 10 non-binding propositions will be tabulated and delivered to the State Republican Executive Committee and Texas GOP leadership. Propositions that win strong support — especially in Republican strongholds like Comal County — will carry significant weight at the June 2026 Texas GOP Convention and when the 90th Legislature convenes in January 2027.\n\nYour yes or no isn't just a poll. It's a message to Austin.\n\nSource: Republican Party of Texas / Hill Country Sentinel analysis",
    "source": "Hill Country Sentinel",
    "tags": [
      "republican-primary",
      "ballot-propositions",
      "property-tax",
      "parental-rights",
      "comal-county",
      "voter-guide",
      "2026-election"
    ],
    "category": "elections",
    "image": null,
    "sourceUrl": null
  },
  {
    "id": "pf-1771689600000-no-statewide-texas-ballot-propositions-for-2026-what-comal-cou",
    "date": "2026-02-21T14:40:00",
    "title": "No Statewide Ballot Propositions for Comal County in 2026 — Here's Why, and What's Next",
    "summary": "Comal County voters will not see any statewide constitutional amendments or Texas-wide ballot propositions on their ballots this year. Here is a plain-English explanation of how Texas ballot propositions work and what to expect.\n\nTexas voters approved 17 constitutional amendments on November 4, 2025, the last batch passed by the 89th Texas Legislature during its 2025 regular session. Those measures addressed topics including a capital gains tax ban, increased homestead tax exemptions, and various state government restructurings.\n\nFor statewide propositions to appear on a ballot, the Texas Legislature must pass a joint resolution (HJR or SJR) by a two-thirds supermajority in both chambers. The Legislature meets in regular session every odd-numbered year — the 90th Legislature will convene in January 2027. Any constitutional amendments it passes would go to Texas voters in November 2027.\n\nNo special or called session of the 89th Legislature has placed additional amendments on the 2026 ballot. The May 2, 2026 Uniform Election Date is limited to local candidate races — including the New Braunfels city elections. The Ballotpedia page for Texas 2026 statewide ballot measures does not yet exist.\n\nNote: The March 3, 2026 Republican and Democratic primary ballots each included 10 non-binding advisory propositions — party polling questions that do not change state law but signal voter priorities for the 2027 legislative session. The Sentinel's Ballot Measures section details all 10 Republican primary propositions.",
    "source": "Hill Country Sentinel",
    "sourceUrl": "https://e1cap1tan.github.io/hill-country-sentinel/",
    "category": "elections",
    "tags": [
      "ballot-measures",
      "statewide-propositions",
      "texas-constitution",
      "constitutional-amendments",
      "voter-guide",
      "comal-county",
      "2026-election"
    ]
  },
  {
    "id": "pf-1771689000000-may-2026-new-braunfels-election-candidate-races-no-propositi",
    "date": "2026-02-21T14:30:00",
    "title": "May 2026 New Braunfels Election: Candidate Races Only, No Ballot Propositions",
    "summary": "The May 2, 2026 New Braunfels General Election will be a candidate-only ballot — no bond measures, charter amendments, or ballot propositions are scheduled for local voters this cycle. City Council officially ordered the election on February 9, featuring three contested races: Mayor (Neal Linnartz, Michael French, Angela Allen, Jonathon Frazier, and Bradley Porter), City Council District 5 (Mary Ann Labowski), and City Council District 6 (April Ryan with challengers Nikki Shaw and Steven Voges). The city's last bond election was May 2023, when voters approved $140 million across three propositions for parks, streets, and libraries with no projected tax rate increase. New Braunfels ISD last held a bond election in May 2024. No charter amendments were submitted to the city secretary before the February deadline for this cycle. Comal County also has no ballot measures on the May 2 date. Early voting runs April 20–28; voter registration deadline is April 2. Source: City of New Braunfels Elections Office, newbraunfels.gov/3894/May-2026-Election-Info.",
    "source": "Hill Country Sentinel",
    "sourceUrl": "https://newbraunfels.gov/3894/May-2026-Election-Info",
    "category": "elections",
    "tags": [
      "ballot-measures",
      "may-2026-election",
      "city-council",
      "mayor",
      "new-braunfels",
      "comal-county",
      "voter-guide"
    ]
  },
  {
    "id": "pf-1771682544957-city-council-approves-16m-construction-contract-for-southeas",
    "date": "2026-02-21T14:02:24",
    "title": "City Council Approves $16M Construction Contract for Southeast Branch Library",
    "summary": "New Braunfels City Council approved a $16 million contract with Byrne Construction Services for the construction of the Southeast Branch Library on February 9. The 23,520-square-foot facility south of the Guadalupe River will serve a rapidly growing area with youth-focused design, meeting spaces, and outdoor garden. The project is funded through the city's voter-approved 2023 bond program Proposition C, which allocated $28.56 million to library services. Construction is expected to begin this summer.",
    "source": "Community Impact",
    "sourceUrl": "https://communityimpact.com/san-antonio/new-braunfels/government/2026/02/19/city-council-approves-16m-construction-contract-for-southeast-branch-library-in-new-braunfels/",
    "category": "infrastructure",
    "tags": [
      "library",
      "bond-funding",
      "byrne-construction",
      "southeast",
      "infrastructure",
      "city-council"
    ]
  },
  {
    "id": "pf-1771620199775-local-resident-highlights-community-development-tensions",
    "date": "2026-02-20T20:43:19",
    "title": "Local Resident Highlights Community Development Tensions",
    "summary": "A Country Hills Nextdoor post by Robert Cruzen captures ongoing tensions around New Braunfels development regarding vacation rentals, data centers, sewage treatment, water quality, business regulation, and infrastructure needs. The post reflects diverse resident concerns about growth management in the expanding city.",
    "source": "Local Community Discussion",
    "sourceUrl": "https://example.com/editorial-review-needed",
    "category": "infrastructure",
    "tags": [
      "development",
      "infrastructure",
      "water-quality",
      "business-regulation",
      "community-concerns"
    ]
  },
  {
    "id": "pf-1771509760226-headwaters-at-comal-begins-final-9m-construction-phase",
    "date": "2026-02-19T14:02:40",
    "title": "Headwaters at Comal Begins Final .9M Construction Phase",
    "summary": "Headwaters at the Comal has begun Phase 3 of its .3 million expansion project, adding .9 million in aquifer exhibits, wetlands, and low-impact facilities. The centerpiece project showcasing New Braunfels' natural aquifer resources expects completion in early 2027, representing significant investment in local environmental education and tourism infrastructure.",
    "source": "Community Impact",
    "sourceUrl": "https://communityimpact.com/san-antonio/new-braunfels/development/2026/02/13/headwaters-at-the-comal-begins-final-phase-of-293m-expansion/",
    "category": "infrastructure",
    "tags": [
      "headwaters",
      "comal-springs",
      "tourism",
      "environmental",
      "infrastructure"
    ]
  },
  {
    "id": "pf-1771509748445-38-acre-rezoning-expected-at-feb-23-council-meeting",
    "date": "2026-02-19T14:02:28",
    "title": "38-Acre Rezoning Expected at Feb 23 Council Meeting",
    "summary": "New Braunfels City Council will consider a 38-acre rezoning request at their February 23 meeting. The proposed rezoning would change agricultural land to residential use for new development.",
    "source": "Community Impact",
    "sourceUrl": "https://communityimpact.com/san-antonio/new-braunfels/development/2026/02/17/new-braunfels-city-council-to-consider-38-acre-rezoning-for-new-development/",
    "category": "infrastructure",
    "tags": [
      "zoning",
      "city-council",
      "development",
      "community-opposition"
    ]
  },
  {
    "id": "pf-1771509742248-city-council-approves-controversial-zoning-change-after-comm",
    "date": "2026-02-19T14:02:22",
    "title": "City Council Approves Controversial Zoning Change After Community Opposition",
    "summary": "New Braunfels City Council voted on a controversial zoning change for a 38-acre housing development despite homeowner concerns about traffic, water/sewer issues, and Hill Country preservation. The property will be rezoned from R1 Agricultural to single-family residential for a proposed development.",
    "source": "KSAT",
    "sourceUrl": "https://www.ksat.com/news/local/2026/02/18/new-braunfels-city-council-to-decide-on-controversial-zoning-change-for-proposed-housing-project/",
    "category": "infrastructure",
    "tags": [
      "zoning",
      "city-council",
      "traffic",
      "infrastructure"
    ]
  },
  {
    "id": "pf-1771507936028-new-braunfels-adds-license-plate-recognition-cameras",
    "date": "2026-02-19T13:32:16",
    "title": "New Braunfels Adds License Plate Recognition Cameras",
    "summary": "New Braunfels has implemented Flock license plate recognition cameras for public safety enhancement, as covered by the Herald-Zeitung.",
    "source": "Herald-Zeitung",
    "sourceUrl": "https://herald-zeitung.com/news/new-braunfels-adds-flock-license-plate-recognition-cameras-enhancing-public-safety/article_22e63198-ec9e-41f9-a9d2-aa8bf91c3694.html",
    "category": "public-safety",
    "tags": [
      "public-safety",
      "surveillance",
      "city-council"
    ]
  },
  {
    "id": "pf-1771455683022-city-council-to-decide-on-controversial-38-acre-housing-proj",
    "date": "2026-02-18T23:01:23",
    "title": "City Council to Decide on Controversial 38-Acre Housing Project",
    "summary": "New Braunfels City Council faces decision on controversial zoning change for 131-home development by KB Homes. Residents raise concerns about increased traffic, ongoing water/sewer issues, and loss of Hill Country green space in rapidly developing area.",
    "source": "KSAT",
    "sourceUrl": "https://www.ksat.com/news/local/2026/02/18/new-braunfels-city-council-to-decide-on-controversial-zoning-change-for-proposed-housing-project/",
    "category": "city-council",
    "tags": [
      "zoning",
      "development",
      "kb-homes",
      "city-council",
      "traffic",
      "infrastructure"
    ]
  },
  {
    "id": "pf-1771441051288-new-braunfels-adds-license-plate-recognition-cameras",
    "date": "2026-02-18T18:57:31",
    "title": "New Braunfels Adds License Plate Recognition Cameras",
    "summary": "New Braunfels has installed Flock license plate recognition cameras to enhance public safety, a Herald-Zeitung report. Community discussion on Nextdoor reflects concerns about surveillance and privacy.",
    "source": "Herald-Zeitung",
    "sourceUrl": "https://herald-zeitung.com/news/new-braunfels-adds-flock-license-plate-recognition-cameras-enhancing-public-safety/article_22e63",
    "category": "public-safety",
    "tags": [
      "surveillance",
      "public-safety",
      "technology",
      "new-braunfels"
    ]
  },
  {
    "id": "pf-1771369320367-next-chapter-56m-southeast-library-looks-to-fill-gap-as-popu",
    "date": "2026-02-17T23:02:00",
    "title": "Next chapter: .56M Southeast Library looks to fill gap as population continues to grow in New Braunfels",
    "summary": "The Southeast Library will be located south of the Guadalupe River and east of I-35, off Walnut Avenue, and will add a new branch to the city's existing library system to serve a fast-growing area. The project will be funded by the city's .56 million voter-approved 2023 bond, Proposition C.",
    "source": "Community Impact",
    "sourceUrl": "https://communityimpact.com/san-antonio/new-braunfels/government/2026/02/17/next-chapter-2856m-southeast-library-looks-to-fill-gap-as-population-continues-to-grow-in-new-braunfels/",
    "category": "infrastructure",
    "tags": [
      "library",
      "bond-funding",
      "population-growth",
      "walnut-avenue",
      "infrastructure"
    ]
  },
  {
    "id": "pf-1771369312026-new-braunfels-city-council-to-consider-38-acre-rezoning-for-",
    "date": "2026-02-17T23:01:52",
    "title": "New Braunfels City Council to consider 38-acre rezoning for new development",
    "summary": "",
    "source": "Community Impact",
    "sourceUrl": "https://communityimpact.com/san-antonio/new-braunfels/development/2026/02/17/new-braunfels-city-council-to-consider-38-acre-rezoning-for-new-development/",
    "category": "city-council",
    "tags": [
      "rezoning",
      "development",
      "neighborhood-opposition",
      "planning-commission",
      "city-council"
    ]
  },
  {
    "id": "pf-1771346899959-new-braunfels-isd-declines-to-adopt-bill-requiring-designate",
    "date": "2026-02-17T16:48:19",
    "title": "New Braunfels ISD declines to adopt bill requiring designated prayer time in schools",
    "summary": "The New Braunfels Independent School District Board of Trustees unanimously voted to decline adopting a resolution related to Senate Bill 11's provisions on prayer in schools.",
    "source": "News4SA",
    "sourceUrl": "https://news4sanantonio.com/news/local/new-braunfels-isd-declines-to-adopt-bill-requiring-designated-prayer-time-in-schools",
    "category": "education",
    "tags": [
      "nbisd",
      "prayer",
      "senate-bill-11",
      "school-board"
    ]
  },
  {
    "id": "pf-1771346893778-comal-county-commissioners-appoint-interim-justice-of-the-pe",
    "date": "2026-02-17T16:48:13",
    "title": "Comal County Commissioners appoint interim justice of the peace for Precinct 3",
    "summary": "Comal County commissioners approved the appointment of Mark Long to fill the vacant justice of the peace, Precinct 3 position on Jan. 29, following the resignation of Mike Rust.",
    "source": "Community Impact",
    "sourceUrl": "https://communityimpact.com/san-antonio/new-braunfels/government/2026/02/04/comal-county-commissioners-appoint-interim-justice-of-the-peace-for-precinct-3/",
    "category": "county-government",
    "tags": [
      "justice-of-peace",
      "mark-long",
      "comal-county",
      "appointment"
    ]
  },
  {
    "id": "pf-1771283014787-senator-donna-campbell-s-abortion-travel-ban-gets-texas-righ",
    "date": "2026-02-16T23:03:34",
    "title": "Senator Donna Campbell's Abortion Travel Ban Gets Texas Right to Life Endorsement",
    "summary": "Texas Right to Life PAC endorsed Lt. Governor Dan Patrick, highlighting Senator Donna Campbell's (R-New Braunfels) SB 33 that prevents cities from using taxpayer dollars to fund abortion travel. The bill directly targets efforts by local governments like Austin and San Antonio to subsidize out-of-state abortion trips.",
    "source": "Texas Right to Life PAC",
    "sourceUrl": "https://www.texasrighttolifepac.com/texas-right-to-life-pac-proudly-endorses-lt-governor-dan-patrick/",
    "category": "infrastructure",
    "tags": [
      "donna-campbell",
      "abortion",
      "senate-bill-33",
      "taxpayer-funding"
    ],
    "image": "images/thumbs/pf-1771283014787-senator-donna-campbell-s-abortion-travel-ban-gets-texas-righ.png"
  },
  {
    "id": "local-property-owners-may-face-higher-tax-bills-under-propos",
    "date": "2026-02-16T12:35:26.683967",
    "title": "Local Property Owners May Face Higher Tax Bills Under Proposed County Budget",
    "summary": "Comal County commissioners are reviewing a proposed budget that would increase property tax rates by 3.2% to fund critical infrastructure projects including road improvements and emergency services expansion. The current tax rate of 30.5 cents per $100 valuation was increased 15.4% in 2026 from the previous no-new-revenue rate.",
    "source": "Hill Country Sentinel",
    "sourceUrl": "articles/local-property-owners-may-face-higher-tax-bills-under-propos.html",
    "category": "policy",
    "tags": [
      "property-tax",
      "comal-county",
      "budget"
    ],
    "image": "articles/images/local-property-owners-may-face-higher-tax-bills-under-propos.png"
  },
  {
    "id": "pf-1771077700078-tceq-public-hearing-on-broken-cedar-ranch-draws-500-concerne",
    "date": "2026-02-14T14:01:40",
    "title": "TCEQ Public Hearing on Broken Cedar Ranch Draws 500 Concerned Residents",
    "summary": "Residents expressed dismay at TCEQ's handling of the February 10 public hearing for Lennar's 850-home Broken Cedar Ranch development near Fischer. County judge candidate Kristen Hoyt criticized the statewide bureaucratic system, saying damage from development is 'permanent, expensive and often universal.' Commissioner Doug Leecock said TCEQ and Lennar heard a 'resounding no' from the community regarding the 600,000 gallon-per-day wastewater discharge into Canyon Lake.",
    "source": "My Canyon Lake",
    "sourceUrl": "https://mycanyonlake.com/residents-dismayed-by-tceqs-lack-of-respect-at-public-hearing-for-broken-cedar-ranch-wastewater-permit/",
    "archiveUrl": "articles/archive/tceq-broken-cedar-ranch-hearing-resident-dismay.html",
    "category": "infrastructure",
    "tags": [
      "tceq",
      "lennar",
      "canyon-lake",
      "development",
      "wastewater",
      "kristen-hoyt",
      "doug-leecock",
      "fischer"
    ],
    "image": "images/thumbs/pf-1771077700078-tceq-public-hearing-on-broken-cedar-ranch-draws-500-concerne.jpg"
  },
  {
    "id": "pf-1771023743385-new-braunfels-pay-to-park-system-faces-backlash-despite-k-re",
    "date": "2026-02-13T23:02:23",
    "title": "New Braunfels Pay-to-Park System Faces Backlash Despite $300K Revenue",
    "summary": "New Braunfels' downtown pay-to-park system has generated approximately $300,000 in six months but faces significant pushback from residents and business owners who report it's driving customers away. City Council will discuss potential updates later this month.",
    "source": "News4SA",
    "sourceUrl": "https://news4sanantonio.com/news/local/new-braunfels-pay-to-park-system-faces-backlash-despite-revenue-boost",
    "archiveUrl": "articles/archive/pay-to-park-backlash-revenue-boost.html",
    "category": "city-council",
    "tags": [
      "parking",
      "downtown",
      "revenue",
      "business-impact",
      "city-council"
    ],
    "image": "images/thumbs/pf-1771023743385-new-braunfels-pay-to-park-system-faces-backlash-despite-k-re.jpeg"
  },
  {
    "id": "pf-1770921933787-new-braunfels-and-comal-county-to-share-emergency-operations",
    "date": "2026-02-12T18:45:33",
    "title": "New Braunfels and Comal County to Share Emergency Operations Space",
    "summary": "New Braunfels will partner with Comal County to share emergency operations facilities, improving coordination and resource efficiency for disaster response and emergency management.",
    "source": "Community Impact",
    "sourceUrl": "https://communityimpact.com/san-antonio/new-braunfels/government/2026/01/30/new-braunfels-to-share-emergency-operations-space-with-comal-county/",
    "archiveUrl": "articles/archive/emergency-operations-sharing.html",
    "category": "public-safety",
    "tags": [
      "emergency-management",
      "county-cooperation",
      "disaster-response"
    ],
    "image": "images/thumbs/pf-1770921933787-new-braunfels-and-comal-county-to-share-emergency-operations.jpg"
  },
  {
    "id": "pf-1770921929154-comal-county-appoints-interim-justice-of-peace-for-precinct-",
    "date": "2026-02-12T18:45:29",
    "title": "Comal County Appoints Interim Justice of Peace for Precinct 3",
    "summary": "Comal County commissioners appointed Mark Long as interim judge to fulfill the unexpired term for justice of the peace in Precinct 3, filling a judicial vacancy.",
    "source": "Community Impact",
    "sourceUrl": "https://communityimpact.com/san-antonio/new-braunfels/government/2026/02/04/comal-county-commissioners-appoint-interim-justice-of-the-peace-for-precinct-3/",
    "archiveUrl": "articles/archive/interim-justice-peace-precinct-3.html",
    "category": "county-government",
    "tags": [
      "justice-of-peace",
      "appointment",
      "precinct-3",
      "mark-long"
    ],
    "image": "images/thumbs/pf-1770921929154-comal-county-appoints-interim-justice-of-peace-for-precinct-.jpg"
  },
  {
    "id": "pf-1770921859944-city-council-approves-tirz-board-appointments",
    "date": "2026-02-12T18:44:19",
    "title": "City Council Approves TIRZ Board Appointments",
    "summary": "New Braunfels City Council approved appointments to River Mill, Zipp Park, and West End TIRZ boards. Terms expire November 2027, except for Kyle Coker, Skylar Duran, and Patrick Wiggins whose terms expire in 2026.",
    "source": "Herald-Zeitung",
    "sourceUrl": "https://herald-zeitung.com/news/new-braunfels-city-council-approves-river-mill-zipp-park-west-end-tirz-boards-appointments/article_0e8a4878-7807-4760-bb4c-842c97c0a494.html",
    "archiveUrl": "articles/archive/city-council-tirz-appointments.html",
    "category": "city-council",
    "tags": [
      "tirz",
      "board-appointments",
      "city-council"
    ],
    "image": "images/thumbs/pf-1770921859944-city-council-approves-tirz-board-appointments.jpg"
  },
  {
    "id": "pf-1770921852554-new-braunfels-approves-2m-fire-training-facility-investment",
    "date": "2026-02-12T18:44:12",
    "title": "New Braunfels Approves .2M Fire Training Facility Investment",
    "summary": "The city has allocated .2 million for a new fire training facility to boost firefighter readiness and response capabilities as the community continues to grow.",
    "source": "Community Impact",
    "sourceUrl": "https://communityimpact.com/san-antonio/new-braunfels/government/2026/02/10/city-of-new-braunfels-invests-42m-in-fire-training-facility-to-boost-firefighter-readiness/",
    "archiveUrl": "articles/archive/fire-training-facility-investment.html",
    "category": "public-safety",
    "tags": [
      "fire-department",
      "budget",
      "infrastructure",
      "training"
    ],
    "image": "images/thumbs/pf-1770921852554-new-braunfels-approves-2m-fire-training-facility-investment.JPG"
  },
  {
    "id": "pf-1770921839765-new-braunfels-isd-rejects-state-prayer-time-requirement",
    "date": "2026-02-12T18:43:59",
    "title": "New Braunfels ISD Rejects State Prayer Time Requirement",
    "summary": "The NBISD Board of Trustees unanimously voted to decline adopting Senate Bill 11's required daily prayer and religious reading period, citing parental autonomy and existing religious expression rights.",
    "source": "Herald-Zeitung",
    "sourceUrl": "https://herald-zeitung.com/news/new-braunfels-isd-vetoes-designated-prayer-period-cites-parental-autonomy/article_169e0c2f-c6ca-4eab-8e08-356fdba0709a.html",
    "archiveUrl": "articles/archive/nbisd-prayer-time-rejection.html",
    "category": "education",
    "tags": [
      "nbisd",
      "school-board",
      "religious-policy",
      "senate-bill-11"
    ],
    "image": "images/thumbs/pf-1770921839765-new-braunfels-isd-rejects-state-prayer-time-requirement.jpg"
  },
  {
    "id": "pf-001",
    "date": "2026-02-09T12:00:00",
    "title": "New Braunfels City Council Approves Annexation of 200 Acres",
    "summary": "City Council voted 5-2 to annex approximately 200 acres along FM 306 for future mixed-use development. Council members Edwards and Spradley voted against, citing infrastructure concerns.",
    "source": "Herald-Zeitung",
    "sourceUrl": "https://herald-zeitung.com/news/new-braunfels-city-council-approves-river-mill-zipp-park-west-end-tirz-boards-appointments/article_0e8a4878-7807-4760-bb4c-842c97c0a494.html",
    "archiveUrl": "articles/archive/nb-annexation-fm306.html",
    "category": "city-council",
    "tags": [
      "annexation",
      "development",
      "new-braunfels"
    ],
    "image": "images/thumbs/pf-001.jpg"
  }
]